<?php

return [
	// 三すくみの名前
	'typeStr' => [
		'goo' => 'グー',
		'cho' => 'チョキ',
		'paa' => 'パー',
	],
	// 勝敗の名前
	'resultStr' => [
		'win' => '勝ち',
		'lose' => '負け',
		'draw' => 'あいこ',
	],
	// ダメージの変化量(％)
	'damagePer' => [
		'min' => 80,
		'max' => 120,
	],
	// 賞金の歩合
	'prizeStr' =>[
		'Commission' => 30,
	],
	// 敵キャラのレベルによる賞金の補正値(％)
	'prizeRatio' =>[
		'下級' => 70,
		'中級' => 100,
		'上級' => 140,
	],
	// 難易度
	'difficulty' =>[
		'easy'	=> '下級',
		'nomal' => '中級',
		'hard'	=> '上級',
	],
	// 敵キャラのレベルによるステータスの補正値
	'enemyRatio'=>[
		'下級'	=> '0.7',
		'中級'	=> '1',
		'上級'	=> '1.3',
	],
];